app/controllers/gists_controller.rb

  def index
    @gists = Gist.search(params[:search]).paginate(page: params[:page], per_page: 5).order('created_at DESC')
---
SELECT "gists".* FROM "gists" WHERE (description LIKE '%delphi%') ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "gists" WHERE (description LIKE '%c%')

  def create
    @gist = Gist.new(gist_params)

    respond_to do |format|
      if @gist.save
---
INSERT INTO "gists" ("created_at", "description", "lang", "snippet", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 01 Apr 2014 13:44:57 UTC +00:00], ["description", "heh"], ["lang", "c++"], ["snippet", "jakiś snippet"], ["updated_at", Tue, 01 Apr 2014 13:44:57 UTC +00:00]]

  def update
    respond_to do |format|
      if @gist.update(gist_params)
---
UPDATE "gists" SET "snippet" = ?, "updated_at" = ? WHERE "gists"."id" = 1  [["snippet", "cout<<\"hello world\";"], ["updated_at", Tue, 01 Apr 2014 13:49:10 UTC +00:00]]

    def set_gist
      @gist = Gist.find(params[:id])
---
SELECT "gists".* FROM "gists" WHERE "gists"."id" = ? LIMIT 1  [["id", "1"]]